# 测试map函数，它可以将一个或多个可迭代对象的所有元素应用某个函数后的结果作为可迭代对象返回。


def f(x):
    return x + 10


a = list(range(1, 10))
b = map(f, a)  # 将列表a中的每个元素应用函数f，即每个元素都加10后返回
b = list(b)
print(b)  # [11, 12, 13, 14, 15, 16, 17, 18, 19]

c = list(range(1, 10))
d = list(range(21, 30))


def f(x, y):
    return x * y


# 当map函数传递的可迭代对象是多个时，会把多个可迭代对象的相同位置的元素一起应用某个函数。
e = map(f, c, d)
e = list(e)
print(e)  # [21, 44, 69, 96, 125, 156, 189, 224, 261]

# 当传递的多个可迭代对象的元素个数不一致时，只取两边都有元素的位置的元素进行函数应用，多余的将忽略。
d = list(range(1, 5))
e = list(map(f, c, d))
print(e)    # [1, 4, 9, 16]

