package main

import (
	"fmt"
	// 引用了model这个包
	"example.com/elim/basic/var/demo01/model"
)

func main() {
	fmt.Println(model.Name)
	//-1的原码1000 0001,反码1111 1110,补码1111 1111,右移两位后溢出的低位11截掉后是11 1111,缺少的高位补符号为即1111 1111,所以结果还是-1
	a := -1 >> 2
	//-1的原码1000 1010,反码1111 0101,补码1111 0110,右移两位后溢出的低位10截掉后是11 1101,缺少的高位补符号为即1111 1101,
	// 1111 1101对应的反码是1111 1100,原码是1000 0011,所以b的结果是-3
	b := -10 >> 2
	//-1的原码1000 0001,反码1111 1110,补码1111 1111,左移两位后低位补两个0,即1111 1111 00,对应的反码是1111 1110 11,对应的原码
	// 是1000 0001 00,1在倒数第3位表示4,符号位是1,即表示-4。
	c := -1 << 2
	fmt.Println(a, b, c)
}
