a = {1, 2, 3, 3, 2, 1}   #Set中的元素不能重复，且是无序的。
print(len(a))   #3

a.add(10)   #增加一个元素
a = a.union({20, 30, 40})   #组合另一个Set，形成一个新的Set

print(a)    #{1, 2, 3, 20, 40, 10, 30}

a.update({50, 60, 70, 80, 90})  #把一个Set中的元素都合并到另一个Set中
print(a)    #{1, 2, 3, 70, 40, 10, 80, 50, 20, 90, 60, 30}

b = {1, 3, 50, 100, 200}
print(a.difference(b))  #输出a有而b没有的元素组成的Set。{2, 70, 40, 10, 80, 20, 90, 60, 30}

print(a.intersection(b))    #输出a和b中都由的元素组成的Set。{1, 50, 3}

print(a|b)  #输出a和b的并集。{1, 2, 3, 100, 70, 40, 200, 10, 80, 50, 20, 90, 60, 30}
print(a&b)  #输出a和b的交集。{1, 50, 3}
print(a-b)  #输出a和b的差集，即a中有，而b中没有的部分。{2, 70, 40, 10, 80, 20, 90, 60, 30}

a.remove(80)    #删除一个元素

a.pop() #随机删除一个元素
print(a)    #{2, 3, 70, 40, 10, 50, 20, 90, 60, 30}